Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
series = pd.Series([4, 8, 15, 16, 23, 42])

print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [2]:
l = [1,2,3,4,5,6,7,8,9,10]
s = pd.Series(l)
print(s)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [3]:

data = {
    "Name": ["Alice", "Bob", "Claire"],
    "Age": [25, 30, 27],
    "Gender": ["Female", "Male", "Female"]
}

df = pd.DataFrame(data)

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans.

**Series:** Represents a single column of data, one-dimensional, homogeneous data type.

**DataFrame:** Represents a table of data, two-dimensional, heterogeneous data types across columns.

In [4]:
data_series = pd.Series([4, 8, 15, 16, 23, 42])
print("Pandas Series:")
print(data_series)
data = {
    "Name": ["Alice", "Bob", "Claire"],
    "Age": [25, 30, 27],
    "Gender": ["Female", "Male", "Female"]
}

data_frame = pd.DataFrame(data)
print("\nPandas DataFrame:")
print(data_frame)

Pandas Series:
0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Pandas DataFrame:
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

ans.
groupby()
mean()

In [5]:
data = {
    "Employee": ["Alice", "Bob", "Claire", "David", "Eve"],
    "Department": ["HR", "Engineering", "HR", "Engineering", "Marketing"],
    "Salary": [50000, 80000, 60000, 85000, 55000]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)
average_salary = df.groupby('Department')['Salary'].mean()

print("\nAverage Salary by Department:")
print(average_salary)

Original DataFrame:
  Employee   Department  Salary
0    Alice           HR   50000
1      Bob  Engineering   80000
2   Claire           HR   60000
3    David  Engineering   85000
4      Eve    Marketing   55000

Average Salary by Department:
Department
Engineering    82500.0
HR             55000.0
Marketing      55000.0
Name: Salary, dtype: float64

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans. panel

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [6]:
names = pd.Series(["Alice", "Bob", "Claire"])
ages = pd.Series([25, 30, 27])
genders = pd.Series(["Female", "Male", "Female"])
df = pd.DataFrame({
    "Name": names,
    "Age": ages,
    "Gender": genders
})

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female